import pandas as pd

data = {
    '시가': [980, 200, 300],
    '고가': [990, 300, 500],
    '저가': [920, 180, 300],
    '종가': [930, 180, 400]
}

index = ["비트코인", "리플", "이더리움"]

df = pd.DataFrame(data=data, index=index)
print(df)
"""
       시가   고가   저가   종가
비트코인  980  990  920  930
리플    200  300  180  180
이더리움  300  500  300  400
"""

# --------------------------------------------------------

data = [
    [980, 990, 920, 930],
    [200, 300, 180, 180],
    [300, 500, 300, 400],
]

index = ["비트코인", "리플", "이더리움"]
columns = ["시가", "고가", "저가", "종가"]

df = pd.DataFrame(data=data, index=index, columns=columns)
print(df)
"""
       시가   고가   저가   종가
비트코인  980  990  920  930
리플    200  300  180  180
이더리움  300  500  300  400
"""
