"""
컬럼 시프트
    데이터프레임의 연산은 기본적으로 같은 인덱스에 있는 컬럼과 컬럼 사이에 적용됨
    당일 종가와 전일 종가를 빼려면 어떻게 해야하는가?

    df["컬럼명"].shift(1)
        특정 컬럼의 데이터를 아래로 하나씩 이동
"""

import pyupbit
df = pyupbit.get_ohlcv_from("KRW-XRP")
print(df)


df.drop( [ "volume", "value"], axis = 1, inplace = True)
print(df.head())
"""
                      open   high    low  close
2017-09-25 09:00:00  200.0  205.0  199.0  203.0
2017-09-26 09:00:00  203.0  217.0  203.0  211.0
2017-09-27 09:00:00  211.0  235.0  209.0  232.0
2017-09-28 09:00:00  233.0  235.0  215.0  222.0
2017-09-29 09:00:00  221.0  223.0  212.0  220.0
"""


df["shift"] = df["close"].shift(1)
print(df.head())
"""
                      open   high    low  close  shift
2017-09-25 09:00:00  200.0  205.0  199.0  203.0    NaN
2017-09-26 09:00:00  203.0  217.0  203.0  211.0  203.0
2017-09-27 09:00:00  211.0  235.0  209.0  232.0  211.0
2017-09-28 09:00:00  233.0  235.0  215.0  222.0  232.0
2017-09-29 09:00:00  221.0  223.0  212.0  220.0  222.0
"""

df["종가변화"] = df["close"] - df["shift"]
print(df)