"""
연습문제
1. 고가와 저가 차이가 100 이상인 날의 고가를 출력하세요.
저가 = Series([10, 200, 200, 400, 600])
고가 = Series([100, 300, 400, 500, 600])
"""

import pandas as pd

저가 = pd.Series([10, 200, 200, 400, 600])
고가 = pd.Series([100, 300, 400, 500, 600])
cond = (고가 - 저가) >= 100
print(고가[cond])
"""
1    300
2    400
3    500
"""



"""
연습문제
2. 종가가 80000원 이상 90000원 미만인 날짜를 출력하라.
종가 = Series([93000, 82400, 99100, 81000, 72300], ["05/14", "05/15", "05/16", "05/17", "05.18"])
"""

data = [93000, 82400, 99100, 81000, 72300]
index = ["05/14", "05/15", "05/16", "05/17", "05.18"]
종가 = pd.Series(data=data, index=index)
조건 = (종가 >= 80000) & (종가 < 90000)
print(종가[조건])
"""
05/15    82400
05/17    81000
dtype: int64
"""